app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("bio", "created_at", "hobby", "updated_at", "work") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bio", "stuff"], ["created_at", Tue, 09 Apr 2013 18:01:58 UTC +00:00], ["hobby", "other stuff"], ["updated_at", Tue, 09 Apr 2013 18:01:58 UTC +00:00], ["work", "some job"]]
---
  def create
      @profile = current_rocketeer.build_profile(params[:profile])
    if @profile.save